In [1]:
print("Hello World!")

Hello World!

#### Mathematical Operations

In [2]:
3 * 5

15

In [3]:
max(10, -5, 15.3)

15.3

In [4]:
abs(-12)

12

In [5]:
import numpy as np

In [6]:
np.abs(-12)

12

In [7]:
type(7)

int

In [8]:
7 / 4

1.75

In [9]:
int(7) / int(4)

1.75

In [10]:
int(7/4)

1

In [11]:
# division as integer
7 // 4

1

In [12]:
(-7) // 4   # largest integer less than or equal to the result

-2

In [13]:
int(-7/4)

-1

In [14]:
7 % 4

3

In [15]:
4 ** 3

64

In [16]:
4 ** 0.5

2.0

In [17]:
5e2

500.0

In [18]:
17e-3 + 4

4.017

#### Strings

In [19]:
"a" + "b"

'ab'

In [20]:
'a' + 'b'

'ab'

#### Variables

In [21]:
a = 3
a

3

In [22]:
print(a + 5)
print(a + 10)
a * 5
a * 10

8
13

30

In [23]:
b = 5
a + b

8

In [24]:
c = a * b
c

15

In [25]:
s = "Data Science"
s = "Yap101"
s

'Yap101'

In [26]:
print("s: {} {} {:.2f}".format(s, c, c))

s: Yap101 15 15.00

#### Control Statements

In [27]:
if c == 15:
    print('Yap101')
    print(c)
    if 1 == 2:
        print(1)
else:
    print(a)
    print(b)
    print(a, b)

10 ** 2

Yap101
15

100

In [28]:
count=0
while count<5:
   count += 1
   print("Iteration no: {}".format(count))

Iteration no: 1
Iteration no: 2
Iteration no: 3
Iteration no: 4
Iteration no: 5

In [29]:
for num in range(10, 50, 5):
    print(num, end=' ')
else:
    print()
    print(num)

10 15 20 25 30 35 40 45
45

#### DataFrames

In [30]:
import pandas as pd

In [31]:
cones = pd.read_csv('./data/cones.csv')

In [32]:
cones

       Flavor        Color  Price
0  strawberry         pink   3.55
1   chocolate  light brown   4.75
2   chocolate   dark brown   5.25
3  strawberry         pink   5.25
4   chocolate   dark brown   5.25
5   bubblegum         pink   4.75

In [33]:
cones.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Flavor  6 non-null      object
 1   Color   6 non-null      object
 2   Price   6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 272.0+ bytes

In [34]:
cones.describe()

          Price
count  6.000000
mean   4.800000
std    0.659545
min    3.550000
25%    4.750000
50%    5.000000
75%    5.250000
max    5.250000

In [35]:
cones.head()

       Flavor        Color  Price
0  strawberry         pink   3.55
1   chocolate  light brown   4.75
2   chocolate   dark brown   5.25
3  strawberry         pink   5.25
4   chocolate   dark brown   5.25

In [36]:
cones.head(3)

       Flavor        Color  Price
0  strawberry         pink   3.55
1   chocolate  light brown   4.75
2   chocolate   dark brown   5.25

In [37]:
cones.tail(3)

       Flavor       Color  Price
3  strawberry        pink   5.25
4   chocolate  dark brown   5.25
5   bubblegum        pink   4.75

In [38]:
cones.drop(columns=['Color'])

       Flavor  Price
0  strawberry   3.55
1   chocolate   4.75
2   chocolate   5.25
3  strawberry   5.25
4   chocolate   5.25
5   bubblegum   4.75

In [39]:
cones

       Flavor        Color  Price
0  strawberry         pink   3.55
1   chocolate  light brown   4.75
2   chocolate   dark brown   5.25
3  strawberry         pink   5.25
4   chocolate   dark brown   5.25
5   bubblegum         pink   4.75

In [40]:
no_colors = cones.drop(columns=['Color'])
no_colors

       Flavor  Price
0  strawberry   3.55
1   chocolate   4.75
2   chocolate   5.25
3  strawberry   5.25
4   chocolate   5.25
5   bubblegum   4.75

In [41]:
temp = cones
temp.drop(columns=['Color'], inplace=True)

In [42]:
temp

       Flavor  Price
0  strawberry   3.55
1   chocolate   4.75
2   chocolate   5.25
3  strawberry   5.25
4   chocolate   5.25
5   bubblegum   4.75

In [43]:
cones.sort_values('Price', ascending=False)

       Flavor  Price
2   chocolate   5.25
3  strawberry   5.25
4   chocolate   5.25
1   chocolate   4.75
5   bubblegum   4.75
0  strawberry   3.55

In [44]:
cones

       Flavor  Price
0  strawberry   3.55
1   chocolate   4.75
2   chocolate   5.25
3  strawberry   5.25
4   chocolate   5.25
5   bubblegum   4.75

In [45]:
cones.iloc[2:6]

       Flavor  Price
2   chocolate   5.25
3  strawberry   5.25
4   chocolate   5.25
5   bubblegum   4.75

In [46]:
cones[['Flavor', 'Price']]

       Flavor  Price
0  strawberry   3.55
1   chocolate   4.75
2   chocolate   5.25
3  strawberry   5.25
4   chocolate   5.25
5   bubblegum   4.75

In [47]:
cones[['Flavor']].iloc[2:6]

       Flavor
2   chocolate
3  strawberry
4   chocolate
5   bubblegum

In [48]:
cones['Flavor']

0    strawberry
1     chocolate
2     chocolate
3    strawberry
4     chocolate
5     bubblegum
Name: Flavor, dtype: object

In [49]:
locs = cones['Flavor'] == 'chocolate'
locs

0    False
1     True
2     True
3    False
4     True
5    False
Name: Flavor, dtype: bool

In [50]:
cones[locs]

      Flavor  Price
1  chocolate   4.75
2  chocolate   5.25
4  chocolate   5.25

In [51]:
cones[cones['Price'] < 5]

       Flavor  Price
0  strawberry   3.55
1   chocolate   4.75
5   bubblegum   4.75